In [39]:
import pandas as pd

# Series

In [40]:
data = [1,2,3,4,5]

s = pd.Series(data)

s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [41]:
index = ['Line' + str(i) for i in range(5)]
index

['Line0', 'Line1', 'Line2', 'Line3', 'Line4']

In [42]:
s = pd.Series(data = data, index = index)
s

Line0    1
Line1    2
Line2    3
Line3    4
Line4    5
dtype: int64

In [43]:
data = {'Line' + str(i) : i + 1 for i in range(5)}
data

{'Line0': 1, 'Line1': 2, 'Line2': 3, 'Line3': 4, 'Line4': 5}

In [44]:
s = pd.Series(data)
s

Line0    1
Line1    2
Line2    3
Line3    4
Line4    5
dtype: int64

In [45]:
s1 = s + 2
s1

Line0    3
Line1    4
Line2    5
Line3    6
Line4    7
dtype: int64

In [46]:
s2 = s + s1
s2

Line0     4
Line1     6
Line2     8
Line3    10
Line4    12
dtype: int64

# Data Frame

In [47]:
data = [[1,2,3], 
        [4,5,6], 
        [7,8,9]]

data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [48]:
df1 = pd.DataFrame(data = data)
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [49]:
index = ['Line' + str(i) for i in range(3)]
index

['Line0', 'Line1', 'Line2']

In [50]:
df1 = pd.DataFrame(data = data, index = index)
df1

       0  1  2
Line0  1  2  3
Line1  4  5  6
Line2  7  8  9

In [51]:
columns = ['Columns' + str(i) for i in range(3)]
columns

['Columns0', 'Columns1', 'Columns2']

In [52]:
df1 = pd.DataFrame(data = data, index = index, columns = columns)
df1

       Columns0  Columns1  Columns2
Line0         1         2         3
Line1         4         5         6
Line2         7         8         9

In [53]:
data = {'Columns0': {'Line0': 1, 'Line1': 4, 'Line2': 7},
        'Columns1': {'Line0': 2, 'Line1': 5, 'Line2': 8},
        'Columns2': {'Line0': 3, 'Line1': 6, 'Line2': 9}}

data

{'Columns0': {'Line0': 1, 'Line1': 4, 'Line2': 7},
 'Columns1': {'Line0': 2, 'Line1': 5, 'Line2': 8},
 'Columns2': {'Line0': 3, 'Line1': 6, 'Line2': 9}}

In [54]:
df2 = pd.DataFrame(data)
df2

       Columns0  Columns1  Columns2
Line0         1         2         3
Line1         4         5         6
Line2         7         8         9

In [55]:
data = [{1,2,3}, 
        {4,5,6}, 
        {7,8,9}]

data

[{1, 2, 3}, {4, 5, 6}, {7, 8, 9}]

In [56]:
df3 = pd.DataFrame(data = data, index = index, columns = columns)
df3

       Columns0  Columns1  Columns2
Line0         1         2         3
Line1         4         5         6
Line2         8         9         7

In [57]:
df1[df1 > 0] = 'A'
df1

      Columns0 Columns1 Columns2
Line0        A        A        A
Line1        A        A        A
Line2        A        A        A

In [58]:
df2[df2 > 0] = 'B'
df2

      Columns0 Columns1 Columns2
Line0        B        B        B
Line1        B        B        B
Line2        B        B        B

In [59]:
df3[df3 > 0] = 'C'
df3

      Columns0 Columns1 Columns2
Line0        C        C        C
Line1        C        C        C
Line2        C        C        C

In [60]:
df4 = pd.concat([df1,df2,df3])
df4

      Columns0 Columns1 Columns2
Line0        A        A        A
Line1        A        A        A
Line2        A        A        A
Line0        B        B        B
Line1        B        B        B
Line2        B        B        B
Line0        C        C        C
Line1        C        C        C
Line2        C        C        C

In [61]:
df4 = pd.concat([df1,df2,df3], axis = 1)
df4

,Columns0,Columns1,Columns2,Columns0,Columns1,Columns2,Columns0,Columns1,Columns2
Line0,A,A,A,B,B,B,C,C,C
Line1,A,A,A,B,B,B,C,C,C
Line2,A,A,A,B,B,B,C,C,C